using System.Runtime.InteropServices;
using OpenTK;
namespace Quad64 {
[StructLayout(LayoutKind.Explicit)]
public partial struct Row4F : System.IEquatable<Row4F> {
	[FieldOffset(0x00)] public ushort X;
	[FieldOffset(0x02)] public ushort Y;
	[FieldOffset(0x04)] public ushort Z;
	[FieldOffset(0x06)] public ushort W;
	[FieldOffset(0x00)] public ulong Value;
	public static bool Equals(ref Row4F L, ref Row4F R){
		return L.Value==R.Value;
	}
	public static bool Inequals(ref Row4F L, ref Row4F R){
		return L.Value!=R.Value;
	}
	public static bool operator == (Row4F L, Row4F R){
		return L.Value==R.Value;
	}
	public static bool operator != (Row4F L, Row4F R){
		return L.Value!=R.Value;
	}
	public static int GetHashCode(ref Row4F Value){
		return
			Value.Value.GetHashCode();
	}
	public bool Equals(Row4F other){return Equals(ref this, ref other);}
	public bool Equals(ref Row4F other){return Equals(ref this, ref other);}
	public override bool Equals(object obj){return obj is Row4F && ((Row4F)obj).Equals(ref this);}
	public override int GetHashCode(){return GetHashCode(ref this);}
	public void Get(int Index, out ushort Value){
		Value=(0==(2&Index))?(0==(1&Index))?this.X:this.Y:(0==(1&Index))?this.Z:this.W;
	}
	public void Set(int Index, ushort Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
	public void Set(int Index, [In] ref ushort Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
}
[StructLayout(LayoutKind.Explicit)]
public partial struct Row4I : System.IEquatable<Row4I> {
	[FieldOffset(0x00)] public short X;
	[FieldOffset(0x02)] public short Y;
	[FieldOffset(0x04)] public short Z;
	[FieldOffset(0x06)] public short W;
	[FieldOffset(0x00)] public ulong Value;
	public static bool Equals(ref Row4I L, ref Row4I R){
		return L.Value==R.Value;
	}
	public static bool Inequals(ref Row4I L, ref Row4I R){
		return L.Value!=R.Value;
	}
	public static bool operator == (Row4I L, Row4I R){
		return L.Value==R.Value;
	}
	public static bool operator != (Row4I L, Row4I R){
		return L.Value!=R.Value;
	}
	public static int GetHashCode(ref Row4I Value){
		return
			Value.Value.GetHashCode();
	}
	public bool Equals(Row4I other){return Equals(ref this, ref other);}
	public bool Equals(ref Row4I other){return Equals(ref this, ref other);}
	public override bool Equals(object obj){return obj is Row4I && ((Row4I)obj).Equals(ref this);}
	public override int GetHashCode(){return GetHashCode(ref this);}
	public void Get(int Index, out short Value){
		Value=(0==(2&Index))?(0==(1&Index))?this.X:this.Y:(0==(1&Index))?this.Z:this.W;
	}
	public void Set(int Index, short Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
	public void Set(int Index, [In] ref short Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
}
[StructLayout(LayoutKind.Explicit)]
public partial struct MtxF : System.IEquatable<MtxF> {
	[FieldOffset(0x00)] public Row4F X;
	[FieldOffset(0x08)] public Row4F Y;
	[FieldOffset(0x10)] public Row4F Z;
	[FieldOffset(0x18)] public Row4F W;
	[FieldOffset(0x00)] public ushort XX;
	[FieldOffset(0x02)] public ushort XY;
	[FieldOffset(0x04)] public ushort XZ;
	[FieldOffset(0x06)] public ushort XW;
	[FieldOffset(0x00)] public ulong XV;
	[FieldOffset(0x08)] public ushort YX;
	[FieldOffset(0x0A)] public ushort YY;
	[FieldOffset(0x0C)] public ushort YZ;
	[FieldOffset(0x0E)] public ushort YW;
	[FieldOffset(0x08)] public ulong YV;
	[FieldOffset(0x10)] public ushort ZX;
	[FieldOffset(0x12)] public ushort ZY;
	[FieldOffset(0x14)] public ushort ZZ;
	[FieldOffset(0x16)] public ushort ZW;
	[FieldOffset(0x10)] public ulong ZV;
	[FieldOffset(0x18)] public ushort WX;
	[FieldOffset(0x1A)] public ushort WY;
	[FieldOffset(0x1C)] public ushort WZ;
	[FieldOffset(0x1E)] public ushort WW;
	[FieldOffset(0x18)] public ulong WV;
	[FieldOffset(0x00)] public uint XX_XY;
	[FieldOffset(0x04)] public uint XZ_XW;
	[FieldOffset(0x08)] public uint YX_YY;
	[FieldOffset(0x0C)] public uint YZ_YW;
	[FieldOffset(0x10)] public uint ZX_ZY;
	[FieldOffset(0x14)] public uint ZZ_ZW;
	[FieldOffset(0x18)] public uint WX_WY;
	[FieldOffset(0x1C)] public uint WZ_WW;
	public static bool Equals(ref MtxF L, ref MtxF R){
		return L.XV==R.XV &&
			L.YV==R.YV &&
			L.ZV==R.ZV &&
			L.WV==R.WV;
	}
	public static bool Inequals(ref MtxF L, ref MtxF R){
		return L.XV!=R.XV ||
			L.YV!=R.YV ||
			L.ZV!=R.ZV ||
			L.WV!=R.WV;
	}
	public static bool operator == (MtxF L, MtxF R){
		return L.XV==R.XV &&
			L.YV==R.YV &&
			L.ZV==R.ZV &&
			L.WV==R.WV;
	}
	public static bool operator != (MtxF L, MtxF R){
		return L.XV!=R.XV ||
			L.YV!=R.YV ||
			L.ZV!=R.ZV ||
			L.WV!=R.WV;
	}
	public static int GetHashCode(ref MtxF Value){
		uint Temp;
		unchecked {
		return
			Value.XV.GetHashCode() ^
			(int)(((((Temp=(uint)Value.YV.GetHashCode()))<<5))|(Temp>>27)) ^
			(int)(((((Temp=(uint)Value.ZV.GetHashCode()))<<10))|(Temp>>22)) ^
			(int)(((((Temp=(uint)Value.WV.GetHashCode()))<<15))|(Temp>>17));
		}
	}
	public bool Equals(MtxF other){return Equals(ref this, ref other);}
	public bool Equals(ref MtxF other){return Equals(ref this, ref other);}
	public override bool Equals(object obj){return obj is MtxF && ((MtxF)obj).Equals(ref this);}
	public override int GetHashCode(){return GetHashCode(ref this);}
	public void Get(int Index, out ushort Value){
		Value=(0==(8&Index))?(0==(4&Index))?(0==(2&Index))?(0==(1&Index))?this.XX:this.XY:(0==(1&Index))?this.XZ:this.XW:(0==(2&Index))?(0==(1&Index))?this.YX:this.YY:(0==(1&Index))?this.YZ:this.YW:(0==(4&Index))?(0==(2&Index))?(0==(1&Index))?this.ZX:this.ZY:(0==(1&Index))?this.ZZ:this.ZW:(0==(2&Index))?(0==(1&Index))?this.WX:this.WY:(0==(1&Index))?this.WZ:this.WW;
	}
	public void Set(int Index, ushort Value){
		if(0==(8&Index))if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX=Value; else this.XY=Value; else if(0==(1&Index))this.XZ=Value; else this.XW=Value; else if(0==(2&Index))if(0==(1&Index))this.YX=Value; else this.YY=Value; else if(0==(1&Index))this.YZ=Value; else this.YW=Value; else if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.ZX=Value; else this.ZY=Value; else if(0==(1&Index))this.ZZ=Value; else this.ZW=Value; else if(0==(2&Index))if(0==(1&Index))this.WX=Value; else this.WY=Value; else if(0==(1&Index))this.WZ=Value; else this.WW=Value;;
	}
	public void Set(int Index, [In] ref ushort Value){
		if(0==(8&Index))if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX=Value; else this.XY=Value; else if(0==(1&Index))this.XZ=Value; else this.XW=Value; else if(0==(2&Index))if(0==(1&Index))this.YX=Value; else this.YY=Value; else if(0==(1&Index))this.YZ=Value; else this.YW=Value; else if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.ZX=Value; else this.ZY=Value; else if(0==(1&Index))this.ZZ=Value; else this.ZW=Value; else if(0==(2&Index))if(0==(1&Index))this.WX=Value; else this.WY=Value; else if(0==(1&Index))this.WZ=Value; else this.WW=Value;;
	}
	public void Get(int Index, out uint Value){
		Value=(0==(4&Index))?(0==(2&Index))?(0==(1&Index))?this.XX_XY:this.XZ_XW:(0==(1&Index))?this.YX_YY:this.YZ_YW:(0==(2&Index))?(0==(1&Index))?this.ZX_ZY:this.ZZ_ZW:(0==(1&Index))?this.WX_WY:this.WZ_WW;
	}
	public void Set(int Index, uint Value){
		if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX_XY=Value; else this.XZ_XW=Value; else if(0==(1&Index))this.YX_YY=Value; else this.YZ_YW=Value; else if(0==(2&Index))if(0==(1&Index))this.ZX_ZY=Value; else this.ZZ_ZW=Value; else if(0==(1&Index))this.WX_WY=Value; else this.WZ_WW=Value;;
	}
	public void Set(int Index, [In] ref uint Value){
		if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX_XY=Value; else this.XZ_XW=Value; else if(0==(1&Index))this.YX_YY=Value; else this.YZ_YW=Value; else if(0==(2&Index))if(0==(1&Index))this.ZX_ZY=Value; else this.ZZ_ZW=Value; else if(0==(1&Index))this.WX_WY=Value; else this.WZ_WW=Value;;
	}
	public void Get(int Index, out ulong Value){
		Value=(0==(2&Index))?(0==(1&Index))?this.XV:this.YV:(0==(1&Index))?this.ZV:this.WV;
	}
	public void Set(int Index, ulong Value){
		if(0==(2&Index))if(0==(1&Index))this.XV=Value; else this.YV=Value; else if(0==(1&Index))this.ZV=Value; else this.WV=Value;;
	}
	public void Set(int Index, [In] ref ulong Value){
		if(0==(2&Index))if(0==(1&Index))this.XV=Value; else this.YV=Value; else if(0==(1&Index))this.ZV=Value; else this.WV=Value;;
	}
	public void Get(int Index, out Row4F Value){
		Value=(0==(2&Index))?(0==(1&Index))?this.X:this.Y:(0==(1&Index))?this.Z:this.W;
	}
	public void Set(int Index, Row4F Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
	public void Set(int Index, [In] ref Row4F Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
}
[StructLayout(LayoutKind.Explicit)]
public partial struct MtxI : System.IEquatable<MtxI> {
	[FieldOffset(0x00)] public Row4I X;
	[FieldOffset(0x08)] public Row4I Y;
	[FieldOffset(0x10)] public Row4I Z;
	[FieldOffset(0x18)] public Row4I W;
	[FieldOffset(0x00)] public short XX;
	[FieldOffset(0x02)] public short XY;
	[FieldOffset(0x04)] public short XZ;
	[FieldOffset(0x06)] public short XW;
	[FieldOffset(0x00)] public ulong XV;
	[FieldOffset(0x08)] public short YX;
	[FieldOffset(0x0A)] public short YY;
	[FieldOffset(0x0C)] public short YZ;
	[FieldOffset(0x0E)] public short YW;
	[FieldOffset(0x08)] public ulong YV;
	[FieldOffset(0x10)] public short ZX;
	[FieldOffset(0x12)] public short ZY;
	[FieldOffset(0x14)] public short ZZ;
	[FieldOffset(0x16)] public short ZW;
	[FieldOffset(0x10)] public ulong ZV;
	[FieldOffset(0x18)] public short WX;
	[FieldOffset(0x1A)] public short WY;
	[FieldOffset(0x1C)] public short WZ;
	[FieldOffset(0x1E)] public short WW;
	[FieldOffset(0x18)] public ulong WV;
	[FieldOffset(0x00)] public uint XX_XY;
	[FieldOffset(0x04)] public uint XZ_XW;
	[FieldOffset(0x08)] public uint YX_YY;
	[FieldOffset(0x0C)] public uint YZ_YW;
	[FieldOffset(0x10)] public uint ZX_ZY;
	[FieldOffset(0x14)] public uint ZZ_ZW;
	[FieldOffset(0x18)] public uint WX_WY;
	[FieldOffset(0x1C)] public uint WZ_WW;
	public static bool Equals(ref MtxI L, ref MtxI R){
		return L.XV==R.XV &&
			L.YV==R.YV &&
			L.ZV==R.ZV &&
			L.WV==R.WV;
	}
	public static bool Inequals(ref MtxI L, ref MtxI R){
		return L.XV!=R.XV ||
			L.YV!=R.YV ||
			L.ZV!=R.ZV ||
			L.WV!=R.WV;
	}
	public static bool operator == (MtxI L, MtxI R){
		return L.XV==R.XV &&
			L.YV==R.YV &&
			L.ZV==R.ZV &&
			L.WV==R.WV;
	}
	public static bool operator != (MtxI L, MtxI R){
		return L.XV!=R.XV ||
			L.YV!=R.YV ||
			L.ZV!=R.ZV ||
			L.WV!=R.WV;
	}
	public static int GetHashCode(ref MtxI Value){
		uint Temp;
		unchecked {
		return
			Value.XV.GetHashCode() ^
			(int)(((((Temp=(uint)Value.YV.GetHashCode()))<<5))|(Temp>>27)) ^
			(int)(((((Temp=(uint)Value.ZV.GetHashCode()))<<10))|(Temp>>22)) ^
			(int)(((((Temp=(uint)Value.WV.GetHashCode()))<<15))|(Temp>>17));
		}
	}
	public bool Equals(MtxI other){return Equals(ref this, ref other);}
	public bool Equals(ref MtxI other){return Equals(ref this, ref other);}
	public override bool Equals(object obj){return obj is MtxI && ((MtxI)obj).Equals(ref this);}
	public override int GetHashCode(){return GetHashCode(ref this);}
	public void Get(int Index, out short Value){
		Value=(0==(8&Index))?(0==(4&Index))?(0==(2&Index))?(0==(1&Index))?this.XX:this.XY:(0==(1&Index))?this.XZ:this.XW:(0==(2&Index))?(0==(1&Index))?this.YX:this.YY:(0==(1&Index))?this.YZ:this.YW:(0==(4&Index))?(0==(2&Index))?(0==(1&Index))?this.ZX:this.ZY:(0==(1&Index))?this.ZZ:this.ZW:(0==(2&Index))?(0==(1&Index))?this.WX:this.WY:(0==(1&Index))?this.WZ:this.WW;
	}
	public void Set(int Index, short Value){
		if(0==(8&Index))if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX=Value; else this.XY=Value; else if(0==(1&Index))this.XZ=Value; else this.XW=Value; else if(0==(2&Index))if(0==(1&Index))this.YX=Value; else this.YY=Value; else if(0==(1&Index))this.YZ=Value; else this.YW=Value; else if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.ZX=Value; else this.ZY=Value; else if(0==(1&Index))this.ZZ=Value; else this.ZW=Value; else if(0==(2&Index))if(0==(1&Index))this.WX=Value; else this.WY=Value; else if(0==(1&Index))this.WZ=Value; else this.WW=Value;;
	}
	public void Set(int Index, [In] ref short Value){
		if(0==(8&Index))if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX=Value; else this.XY=Value; else if(0==(1&Index))this.XZ=Value; else this.XW=Value; else if(0==(2&Index))if(0==(1&Index))this.YX=Value; else this.YY=Value; else if(0==(1&Index))this.YZ=Value; else this.YW=Value; else if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.ZX=Value; else this.ZY=Value; else if(0==(1&Index))this.ZZ=Value; else this.ZW=Value; else if(0==(2&Index))if(0==(1&Index))this.WX=Value; else this.WY=Value; else if(0==(1&Index))this.WZ=Value; else this.WW=Value;;
	}
	public void Get(int Index, out uint Value){
		Value=(0==(4&Index))?(0==(2&Index))?(0==(1&Index))?this.XX_XY:this.XZ_XW:(0==(1&Index))?this.YX_YY:this.YZ_YW:(0==(2&Index))?(0==(1&Index))?this.ZX_ZY:this.ZZ_ZW:(0==(1&Index))?this.WX_WY:this.WZ_WW;
	}
	public void Set(int Index, uint Value){
		if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX_XY=Value; else this.XZ_XW=Value; else if(0==(1&Index))this.YX_YY=Value; else this.YZ_YW=Value; else if(0==(2&Index))if(0==(1&Index))this.ZX_ZY=Value; else this.ZZ_ZW=Value; else if(0==(1&Index))this.WX_WY=Value; else this.WZ_WW=Value;;
	}
	public void Set(int Index, [In] ref uint Value){
		if(0==(4&Index))if(0==(2&Index))if(0==(1&Index))this.XX_XY=Value; else this.XZ_XW=Value; else if(0==(1&Index))this.YX_YY=Value; else this.YZ_YW=Value; else if(0==(2&Index))if(0==(1&Index))this.ZX_ZY=Value; else this.ZZ_ZW=Value; else if(0==(1&Index))this.WX_WY=Value; else this.WZ_WW=Value;;
	}
	public void Get(int Index, out ulong Value){
		Value=(0==(2&Index))?(0==(1&Index))?this.XV:this.YV:(0==(1&Index))?this.ZV:this.WV;
	}
	public void Set(int Index, ulong Value){
		if(0==(2&Index))if(0==(1&Index))this.XV=Value; else this.YV=Value; else if(0==(1&Index))this.ZV=Value; else this.WV=Value;;
	}
	public void Set(int Index, [In] ref ulong Value){
		if(0==(2&Index))if(0==(1&Index))this.XV=Value; else this.YV=Value; else if(0==(1&Index))this.ZV=Value; else this.WV=Value;;
	}
	public void Get(int Index, out Row4I Value){
		Value=(0==(2&Index))?(0==(1&Index))?this.X:this.Y:(0==(1&Index))?this.Z:this.W;
	}
	public void Set(int Index, Row4I Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
	public void Set(int Index, [In] ref Row4I Value){
		if(0==(2&Index))if(0==(1&Index))this.X=Value; else this.Y=Value; else if(0==(1&Index))this.Z=Value; else this.W=Value;;
	}
}
[StructLayout(LayoutKind.Explicit)]
public partial struct Mtx : System.IEquatable<Mtx> {
	[FieldOffset(0x00)] public MtxI I;
	[FieldOffset(0x20)] public MtxF F;
	[FieldOffset(0x00)] public Row4I X_I;
	[FieldOffset(0x08)] public Row4I Y_I;
	[FieldOffset(0x10)] public Row4I Z_I;
	[FieldOffset(0x18)] public Row4I W_I;
	[FieldOffset(0x00)] public short XX_I;
	[FieldOffset(0x02)] public short XY_I;
	[FieldOffset(0x04)] public short XZ_I;
	[FieldOffset(0x06)] public short XW_I;
	[FieldOffset(0x00)] public ulong XV_I;
	[FieldOffset(0x08)] public short YX_I;
	[FieldOffset(0x0A)] public short YY_I;
	[FieldOffset(0x0C)] public short YZ_I;
	[FieldOffset(0x0E)] public short YW_I;
	[FieldOffset(0x08)] public ulong YV_I;
	[FieldOffset(0x10)] public short ZX_I;
	[FieldOffset(0x12)] public short ZY_I;
	[FieldOffset(0x14)] public short ZZ_I;
	[FieldOffset(0x16)] public short ZW_I;
	[FieldOffset(0x10)] public ulong ZV_I;
	[FieldOffset(0x18)] public short WX_I;
	[FieldOffset(0x1A)] public short WY_I;
	[FieldOffset(0x1C)] public short WZ_I;
	[FieldOffset(0x1E)] public short WW_I;
	[FieldOffset(0x18)] public ulong WV_I;
	[FieldOffset(0x00)] public uint XX_XY_I;
	[FieldOffset(0x04)] public uint XZ_XW_I;
	[FieldOffset(0x08)] public uint YX_YY_I;
	[FieldOffset(0x0C)] public uint YZ_YW_I;
	[FieldOffset(0x10)] public uint ZX_ZY_I;
	[FieldOffset(0x14)] public uint ZZ_ZW_I;
	[FieldOffset(0x18)] public uint WX_WY_I;
	[FieldOffset(0x1C)] public uint WZ_WW_I;
	[FieldOffset(0x20)] public Row4F X_F;
	[FieldOffset(0x28)] public Row4F Y_F;
	[FieldOffset(0x30)] public Row4F Z_F;
	[FieldOffset(0x38)] public Row4F W_F;
	[FieldOffset(0x20)] public ushort XX_F;
	[FieldOffset(0x22)] public ushort XY_F;
	[FieldOffset(0x24)] public ushort XZ_F;
	[FieldOffset(0x26)] public ushort XW_F;
	[FieldOffset(0x20)] public ulong XV_F;
	[FieldOffset(0x28)] public ushort YX_F;
	[FieldOffset(0x2A)] public ushort YY_F;
	[FieldOffset(0x2C)] public ushort YZ_F;
	[FieldOffset(0x2E)] public ushort YW_F;
	[FieldOffset(0x28)] public ulong YV_F;
	[FieldOffset(0x30)] public ushort ZX_F;
	[FieldOffset(0x32)] public ushort ZY_F;
	[FieldOffset(0x34)] public ushort ZZ_F;
	[FieldOffset(0x36)] public ushort ZW_F;
	[FieldOffset(0x30)] public ulong ZV_F;
	[FieldOffset(0x38)] public ushort WX_F;
	[FieldOffset(0x3A)] public ushort WY_F;
	[FieldOffset(0x3C)] public ushort WZ_F;
	[FieldOffset(0x3E)] public ushort WW_F;
	[FieldOffset(0x38)] public ulong WV_F;
	[FieldOffset(0x20)] public uint XX_XY_F;
	[FieldOffset(0x24)] public uint XZ_XW_F;
	[FieldOffset(0x28)] public uint YX_YY_F;
	[FieldOffset(0x2C)] public uint YZ_YW_F;
	[FieldOffset(0x30)] public uint ZX_ZY_F;
	[FieldOffset(0x34)] public uint ZZ_ZW_F;
	[FieldOffset(0x38)] public uint WX_WY_F;
	[FieldOffset(0x3C)] public uint WZ_WW_F;
	public static bool Equals(ref Mtx L, ref Mtx R){
		return L.XV_I==R.XV_I &&
			L.YV_I==R.YV_I &&
			L.ZV_I==R.ZV_I &&
			L.WV_I==R.WV_I &&
			L.XV_F==R.XV_F &&
			L.YV_F==R.YV_F &&
			L.ZV_F==R.ZV_F &&
			L.WV_F==R.WV_F;
	}
	public static bool Inequals(ref Mtx L, ref Mtx R){
		return L.XV_I!=R.XV_I ||
			L.YV_I!=R.YV_I ||
			L.ZV_I!=R.ZV_I ||
			L.WV_I!=R.WV_I ||
			L.XV_F!=R.XV_F ||
			L.YV_F!=R.YV_F ||
			L.ZV_F!=R.ZV_F ||
			L.WV_F!=R.WV_F;
	}
	public static bool operator == (Mtx L, Mtx R){
		return L.XV_I==R.XV_I &&
			L.YV_I==R.YV_I &&
			L.ZV_I==R.ZV_I &&
			L.WV_I==R.WV_I &&
			L.XV_F==R.XV_F &&
			L.YV_F==R.YV_F &&
			L.ZV_F==R.ZV_F &&
			L.WV_F==R.WV_F;
	}
	public static bool operator != (Mtx L, Mtx R){
		return L.XV_I!=R.XV_I ||
			L.YV_I!=R.YV_I ||
			L.ZV_I!=R.ZV_I ||
			L.WV_I!=R.WV_I ||
			L.XV_F!=R.XV_F ||
			L.YV_F!=R.YV_F ||
			L.ZV_F!=R.ZV_F ||
			L.WV_F!=R.WV_F;
	}
	public static int GetHashCode(ref Mtx Value){
		uint Temp;
